# Read and Write CSV and XLS files

In [1]:
import pandas as pd

df = pd.read_csv('weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [2]:
#INSTALL: pip3 install xlrd

# Read excel file 
df = pd.read_excel('weather_data.xlsx')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [3]:
# Write DF to csv
df.to_csv('new.csv') 
df.to_csv('new_noIndex.csv', index=False)

In [4]:
# INSTALL: pip3 install openpyxl

# Write DF to Excel
df.to_excel('new.xlsx', sheet_name='weather_data')

# GROUP-BY

In [5]:
import pandas as pd

# Weather by cities
df = pd.read_csv('weather_data_cities.csv')
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [6]:
g = df.groupby('city')
g

In [7]:
for city, city_df in g:
    print(city)
    print(city_df)
    print()

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [8]:
# To get specific group
g.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [9]:
# Find maximum temperature in each of the cities
g.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [10]:
g.mean()

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [11]:
g.describe()

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

# Concatenate Data Frames

In [12]:
import pandas as pd

india_weather = pd.DataFrame({
    "City": ["Mumbai","Delhi","Banglore", "Chennai"],
    "Temperature": [32,45,30,32],
    "Humidity": [80, 60, 78, 82]
})

india_weather

       City  Temperature  Humidity
0    Mumbai           32        80
1     Delhi           45        60
2  Banglore           30        78
3   Chennai           32        82

In [13]:
us_weather = pd.DataFrame({
    "City": ["New York","Chicago","Orlando"],
    "Temperature": [21,14,35],
    "Humidity": [68, 65, 75]
})

us_weather

       City  Temperature  Humidity
0  New York           21        68
1   Chicago           14        65
2   Orlando           35        75

In [14]:
# Concate two dataframes
df = pd.concat([india_weather, us_weather])
df

       City  Temperature  Humidity
0    Mumbai           32        80
1     Delhi           45        60
2  Banglore           30        78
3   Chennai           32        82
0  New York           21        68
1   Chicago           14        65
2   Orlando           35        75

In [15]:
# If you want continuous index
df = pd.concat([india_weather, us_weather], ignore_index=True)
df

       City  Temperature  Humidity
0    Mumbai           32        80
1     Delhi           45        60
2  Banglore           30        78
3   Chennai           32        82
4  New York           21        68
5   Chicago           14        65
6   Orlando           35        75

In [16]:
df = pd.concat([india_weather, us_weather],axis=1)
df

       City  Temperature  Humidity      City  Temperature  Humidity
0    Mumbai           32        80  New York         21.0      68.0
1     Delhi           45        60   Chicago         14.0      65.0
2  Banglore           30        78   Orlando         35.0      75.0
3   Chennai           32        82       NaN          NaN       NaN

# Merge Data Frames

In [17]:
temperature_df = pd.DataFrame({
    "City": ["Mumbai","Delhi","Chennai", 'Hyderabad'],
    "Temperature": [32,45,35,40]})

temperature_df

        City  Temperature
0     Mumbai           32
1      Delhi           45
2    Chennai           35
3  Hyderabad           40

In [18]:
humidity_df = pd.DataFrame({
    "City": ["Delhi","Mumbai","Chennai"],
    "Humidity": [68, 65, 75]})

humidity_df

      City  Humidity
0    Delhi        68
1   Mumbai        65
2  Chennai        75

In [19]:
# Merge two dataframes with out explicitly mention index - INNER JOIN
df = pd.merge(temperature_df, humidity_df, on='City')
df

      City  Temperature  Humidity
0   Mumbai           32        65
1    Delhi           45        68
2  Chennai           35        75

In [20]:
# OUTER JOIN
df = pd.merge(temperature_df, humidity_df, on='City', how='outer')
df

        City  Temperature  Humidity
0     Mumbai           32      65.0
1      Delhi           45      68.0
2    Chennai           35      75.0
3  Hyderabad           40       NaN

# Numerical Indexing (.loc vs iloc)

In [21]:
import pandas as pd
import numpy as np

In [22]:
df = pd.DataFrame([1,2,3,4,5,6,7,8,9,19], index=[49,48,47,46,45, 1, 2, 3, 4, 5])
df

     0
49   1
48   2
47   3
46   4
45   5
1    6
2    7
3    8
4    9
5   19

In [23]:
df.loc[:2]

    0
49  1
48  2
47  3
46  4
45  5
1   6
2   7

In [24]:
df.iloc[:2]

    0
49  1
48  2

In [25]:
df.iloc[4]

0    5
Name: 45, dtype: int64

In [26]:
df.loc[45]

0    5
Name: 45, dtype: int64

In [27]:
df.iloc[45]

IndexError: single positional indexer is out-of-bounds